---
kind: type
id: T:Autodesk.Revit.DB.FilePath
source: html/4b02e613-2848-b0df-0de0-a77da2529d66.htm
---
# Autodesk.Revit.DB.FilePath

This class represents a path on a disk or network location, but
 not a path to a Revit server location.

## Syntax (C#)
```csharp
public class FilePath : ModelPath
```